# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

my_list = [2, 3, 5, 9, 3]
sum_pos = 0
for i in range(len(my_list)):
    if i % 2:
        sum_pos += my_list[i]

print(f'ответ: {sum_pos}')