# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
# d = √ [(x2-x1)2+ (y2-y1)2]

import math

print('Введите координаты x и y двух точек: ')
x1 = int(input('x1 = '))
y1 = int(input('y1 = '))
x2 = int(input('x2 = '))
y2 = int(input('y2 = '))
dist = math.sqrt((x2 - x1) ** 2 + (y2 - y1) ** 2)
dist = round(dist, 3)
print(dist)