# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся 
# элементов исходной последовательности.

# list1 = [1, 1, 2, 3, 3, 4, 5, 5, 6, 6, 7]
seq1 = list(str(112334))
seq2 = []
print(seq1)





